src/tests/load/artillery-config.yml

config:
  target: 'http://localhost:8080'
  phases:
    - duration: 60
      arrivalRate: 5
      name: "Warm up phase"
    - duration: 120
      arrivalRate: 10
      name: "Ramp up load"
    - duration: 300
      arrivalRate: 20
      name: "Sustained load"
    - duration: 60
      arrivalRate: 50
      name: "Race day spike"
  payload:
    path: "users.csv"
    fields:
      - "email"
      - "password"

scenarios:
  - name: "Browse F1 data"
    weight: 60
    flow:
      - get:
          url: "/"
      - get:
          url: "/drivers"
      - get:
          url: "/teams"
      - get:
          url: "/races"
      - think: 5

  - name: "Social interaction"
    weight: 30
    flow:
      - post:
          url: "/auth/login"
          json:
            email: "{{ email }}"
            password: "{{ password }}"
      - get:
          url: "/social"
      - post:
          url: "/api/comments"
          json:
            content: "Load test comment"
            race_id: "test-race"
      - think: 3

  - name: "Live timing"
    weight: 10
    flow:
      - get:
          url: "/races/live"
      - think: 10